TestingAndTraining/src/Catalogs/Ответы/Ответы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ответы</name>
  <owners>Catalog.Вопросы</owners>
  <attributes>
    <name>Ответ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Правильный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestingAndTraining/src/Catalogs/Вопросы/Вопросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Вопросы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Тест</name>
    <type>
      <types>CatalogRef.Тесты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вопрос</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийURL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Иллюстрация</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьИллюстрация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestingAndTraining/src/Catalogs/Ответы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	Если Правильный Тогда
		ПроверитьНаличиеПравильногоОтвета(Отказ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНаличиеПравильногоОтвета(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ответы.ПорядковыйНомер,
	|	Ответы.Ответ
	|ИЗ
	|	Справочник.Ответы КАК Ответы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Вопросы КАК Вопросы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Тесты КАК Тесты
	|			ПО Вопросы.Тест = Тесты.Ссылка
	|		ПО Ответы.Владелец = Вопросы.Ссылка
	|ГДЕ
	|	Ответы.Владелец = &Владелец
	|	И Ответы.Ссылка <> &Ссылка
	|	И Ответы.Правильный = ИСТИНА
	|	И Тесты.МножественныеОтветы = ЛОЖЬ
	|	И Ответы.ПометкаУдаления = ЛОЖЬ
	|	И Ответы.Недействителен = ЛОЖЬ
	|СГРУППИРОВАТЬ ПО
	|	Ответы.ПорядковыйНомер,
	|	Ответы.Ответ";

	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Для вопроса уже присутствует правильный ответ'") + " "
			+ ВыборкаДетальныеЗаписи.ПорядковыйНомер + " " + ВыборкаДетальныеЗаписи.Ответ, , , , Отказ);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
